'''
该案例演示了函数参数的传递
'''
#必须参数 --- 按照位置来匹配的
#名称参数 --- 可使用关键字参数来确定参数对应数据
#默认值参数 --- 定义函数时,可直接给定形参默认值,对应形参可省略
#              非默认值参数必须放在默认值参数之前
#不定长参数 --- 参数个数不固定,*参数名,**参数名
'''
*参数名:元组形式  
def my_print(*a):   #后面可以+普通参数,必须以关键字传参形式
    print(a)

my_print(1,2)

**参数名:字典形式
def my_print1(**a):   #后面不可以+普通参数
    print(a)

my_print1(m=10,n=20)   #传递键值对形式参数

'''

#解包传参
'''
def func(a,b,c):
    print(a,b,c)
'''
#func(1,2,3)
#func(a=1,b=2,c=3)

#tup1=(10,20,30)
#func(*tup1)

#dic1={'a':10,'b':20,'c':30}       #通过关键字匹配的,键名要与形参名对应
#func(**dic1)

#强制使用位置参数或关键字参数
    #/前的参数必须使用位置传参,*后的参数必须用关键字传参
def func(a,b,c,/,d,e,*,f,g,h):
    print(a,b,c,d,e,f,g,h)


func(10,20,30,40,50,f=60,g=70,h=80)











